#include "stdio.h"
#include "stdint.h"
/***********************************************************************
ODR	 :输出数据寄存器
IDR	 :输入数据寄存器
MODE :模式寄存器,为1表示对应IO为输出模式,否则为输入模式
***********************************************************************/
typedef struct
{
	volatile uint32_t ODR;
	volatile uint32_t IDR;
	volatile uint32_t MODE;
}GPIO_t;
/***********************************************************************
DIV 	 : Baud = fclk/(DIV+1)/3
SR 		 : bit: 
					0:发送完成标志位,当发送完成时，该位为1，否则为0
					1:接收缓冲区内存在数据标准位，为1时表示接收fifo中有数据，否则没有
DR 		 : 发送/接收数据寄存器
COUNT  : 接收缓冲器数据内数据数量
***********************************************************************/
typedef struct
{
	volatile uint32_t DIV;
	volatile uint32_t SR;
	volatile uint32_t DR;
	volatile uint32_t COUNT;
}UART_t;
/***********************************************************************
指定外设寄存器基地址
***********************************************************************/
GPIO_t *GPIO = (GPIO_t *)0x10000;
UART_t *UART = (UART_t *)0x18000;
/***********************************************************************
实现printf支持函数
***********************************************************************/
uint32_t end;
void UART_SendData(uint8_t data)
{
	while(!(UART->SR&0x01));
	UART->DR = data;
}
int _write (int id, char *buff, int n)
{
	int i,j;
	for(i=0;i<n;i++)
	{
		UART_SendData(buff[i]);
	}
}
/***********************************************************************
main函数
***********************************************************************/
int main(void)
{
	uint32_t i,j;
	GPIO->MODE=0x0000000F;
	GPIO->ODR =0x00000000;
	UART->DIV =21;
	for(;;)
	{
		printf("Hello world,pi=%f\r\n",3.14159265358979323846);
	}
	return 0;
}
